{
  "architectures": [
    "BertForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "directionality": "bidi",
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "\u5174\u594b",
    "1": "\u538c\u6076",
    "2": "\u5bb3\u6015",
    "3": "\u5bb3\u7f9e",
    "4": "\u614c\u5f20",
    "5": "\u62c5\u5fc3",
    "6": "\u65e0\u5948",
    "7": "\u751f\u6c14",
    "8": "\u7591\u60d1",
    "9": "\u7d27\u5f20",
    "10": "\u8ba4\u771f",
    "11": "\u9ad8\u5174"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "\u5174\u594b": 0,
    "\u538c\u6076": 1,
    "\u5bb3\u6015": 2,
    "\u5bb3\u7f9e": 3,
    "\u614c\u5f20": 4,
    "\u62c5\u5fc3": 5,
    "\u65e0\u5948": 6,
    "\u751f\u6c14": 7,
    "\u7591\u60d1": 8,
    "\u7d27\u5f20": 9,
    "\u8ba4\u771f": 10,
    "\u9ad8\u5174": 11
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "pooler_fc_size": 768,
  "pooler_num_attention_heads": 12,
  "pooler_num_fc_layers": 3,
  "pooler_size_per_head": 128,
  "pooler_type": "first_token_transform",
  "position_embedding_type": "absolute",
  "problem_type": "single_label_classification",
  "torch_dtype": "float32",
  "transformers_version": "4.50.0",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 21128
}
